## Production: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 17 to add, 18 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "bulk-not-being-processed-critical" {
      ~ alarm_description                     = "Bulk saving are being created but are not being processed fast enough. Difference > 100" -> "Bulk saving are being created but are not being processed fast enough. Difference > 10000 for 5 minutes"
      ~ alarm_name                            = "bulk-not-being-processed-critical" -> "bulk-buffer-not-being-processed-critical" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:bulk-not-being-processed-critical" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "bulk-not-being-processed-critical" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ ok_actions                            = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> (known after apply)
      - period                                = 0 -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      ~ threshold                             = 100 -> 10000
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "bulk-not-being-processed-warning" {
      ~ alarm_description                     = "Bulk saving are being created but are not being processed fast enough. Difference > 50" -> "Bulk saving are being created but are not being processed fast enough. Difference > 5000 for 5 minutes"
      ~ alarm_name                            = "bulk-not-being-processed-warning" -> "bulk-buffer-not-being-processed-warning" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:bulk-not-being-processed-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "bulk-not-being-processed-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ ok_actions                            = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> (known after apply)
      - period                                = 0 -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      ~ threshold                             = 50 -> 5000
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "contact-3-500-error-15-minutes-critical" {
        id                        = "contact-3-500-error-15-minutes-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "healtheck-page-slow-response-critical" {
        id                        = "healtheck-page-slow-response-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "inflights-not-being-processed-critical" {
      ~ alarm_description         = "Batch saving inflights are being created but are not being processed fast enough. Difference > 100" -> "Batch saving inflights are being created but are not being processed fast enough. Difference > 200 for 5 minutes"
        id                        = "inflights-not-being-processed-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> (known after apply)
        tags                      = {}
      ~ threshold                 = 100 -> 200
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "inflights-not-being-processed-warning" {
      ~ alarm_description         = "Batch saving inflights are being created but are not being processed fast enough. Difference > 50" -> "Batch saving inflights are being created but are not being processed fast enough. Difference > 100 for 5 minutes"
        id                        = "inflights-not-being-processed-warning"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> (known after apply)
        tags                      = {}
      ~ threshold                 = 50 -> 100
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "no-emails-sent-5-minutes-critical" {
        id                        = "no-emails-sent-5-minutes-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ses-bounce-rate-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ses-bounce-rate-critical" {
        id                        = "ses-bounce-rate-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ses-complaint-rate-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ses-complaint-rate-critical" {
        id                        = "ses-complaint-rate-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sign-in-3-500-error-15-minutes-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sign-in-3-500-error-15-minutes-critical" {
        id                        = "sign-in-3-500-error-15-minutes-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sns-sms-success-rate-canadian-numbers-critical" {
        id                        = "sns-sms-success-rate-canadian-numbers-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-us-west-2-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sns-sms-success-rate-canadian-numbers-us-west-2-critical" {
        id                        = "sns-sms-success-rate-canadian-numbers-us-west-2-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:us-west-2:296255494825:alert-critical-us-west-2",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sns-spending-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sns-spending-critical" {
        id                        = "sns-spending-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sns-spending-us-west-2-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sns-spending-us-west-2-critical" {
        id                        = "sns-spending-us-west-2-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:us-west-2:296255494825:alert-critical-us-west-2",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-bulk-queue-delay-critical" {
        id                        = "sqs-bulk-queue-delay-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-db-tasks-stuck-in-queue-critical" {
        id                        = "sqs-db-tasks-stuck-in-queue-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-email-queue-delay-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-email-queue-delay-critical" {
        id                        = "sqs-email-queue-delay-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-send-throttled-sms-tasks-receive-rate-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-send-throttled-sms-tasks-receive-rate-warning" {
        id                        = "sqs-send-throttled-sms-tasks-receive-rate-warning"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-sms-stuck-in-queue-critical" {
        id                        = "sqs-sms-stuck-in-queue-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-throttled-sms-stuck-in-queue-critical" {
        id                        = "sqs-throttled-sms-stuck-in-queue-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> (known after apply)
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_sns_topic.notification-canada-ca-alert-ok will be created
  + resource "aws_sns_topic" "notification-canada-ca-alert-ok" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:296255494825:key/e9461cc1-4524-4b50-b6e6-583013da2904"
      + name                        = "alert-ok"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_sns_topic.notification-canada-ca-alert-ok-us-west-2 will be created
  + resource "aws_sns_topic" "notification-canada-ca-alert-ok-us-west-2" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:us-west-2:296255494825:key/1d29c745-76e8-4fc2-8953-6dde590a44fd"
      + name                        = "alert-ok-us-west-2"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie_ok[0] will be created
  + resource "aws_sns_topic_subscription" "alert_critical_us_west_2_to_opsgenie_ok" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "https://api.opsgenie.com/v1/json/cloudwatch?apiKey=10287c2f-4d6a-4c78-8843-9cb56341f1a2"
      + endpoint_auto_confirms          = true
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.alert_to_sns_to_opsgenie_ok[0] will be created
  + resource "aws_sns_topic_subscription" "alert_to_sns_to_opsgenie_ok" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "https://api.opsgenie.com/v1/json/cloudwatch?apiKey=10287c2f-4d6a-4c78-8843-9cb56341f1a2"
      + endpoint_auto_confirms          = true
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.sns_alert_ok_us_west_2_to_lambda will be created
  + resource "aws_sns_topic_subscription" "sns_alert_ok_us_west_2_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.notify_slack_ok.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.notify_slack_ok.data.aws_iam_policy_document.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowWriteToCloudwatchLogs"
        }
    }

  # module.notify_slack_ok.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.notify_slack_ok.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.notify_slack_ok.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/notify-slack-ok"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_cloudwatch_log_group" "lambda"  {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "/aws/lambda/notify-slack-ok"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.notify_slack_ok.module.lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/notify_slack_ok.lambda/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = ""
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/home/runner/work/notification-terraform/notification-terraform/env/production/common/.terragrunt-cache/51VQ8cOaCmus2jMgoFkn-vAqiTc/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/common"
                  + module = ".terraform/modules/notify_slack_ok.lambda"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = "python3.8"
          + "source_path"              = "\".terraform/modules/notify_slack_ok/functions/notify_slack.py\""
        }
      + result  = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "lambda-notify-slack-ok"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-notify-slack-ok"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.notify_slack_ok.module.lambda.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-notify-slack-ok"
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = (known after apply)
      + function_name                  = "notify-slack-ok"
      + handler                        = "notify_slack.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_EVENTS"        = "False"
              + "SLACK_CHANNEL"     = "notification-ops"
              + "SLACK_EMOJI"       = ":green:"
              + "SLACK_USERNAME"    = "[OK] AWS Cloudwatch"
              + "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "notify-slack-ok"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + qualifier     = (known after apply)
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS"
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "notify-slack-ok"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS"
    }

  # module.notify_slack_ok.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 17 to add, 18 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-sns-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.live-service-over-daily-rate-limit-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-bounce-rate-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-bounce-rate-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-complaint-rate-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-complaint-rate-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sign-in-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-blocked-as-spam-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-blocked-as-spam-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-phone-carrier-unavailable-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-phone-carrier-unavailable-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-rate-exceeded-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-rate-exceeded-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-us-west-2-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-us-west-2-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-email-queue-delay-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-email-queue-delay-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-send-throttled-sms-tasks-receive-rate-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.iam_lambda_to_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sns-delivery-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.bulk_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.inspec-scanner"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.notification-canada-ca-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ses_to_sqs_email_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.sns_to_sqs_sms_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.notification-canada-ca[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.notification-canada-ca[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.notification-canada-ca[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_pinpoint_app.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.dns_query_log_config"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.alb_log_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.asset_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.athena_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.athena_bucket_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.bulk_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.bulk_send_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.csv_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.csv_bucket_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.document_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.document_bucket_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.legacy_asset_bucket[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-critical-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-general"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-ok"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-ok-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-warning-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-ses-callback"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-private[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-private[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-private[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-public[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-public[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-public[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.module.lambda.aws_lambda_function.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_ok.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_ok.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_ok.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]"]

127 tests, 8 passed, 119 warnings, 0 failures, 0 exceptions

```

</details>
